/**
 *
 * Java Cryptography API предоставляет возможность зашифровать и расшифровать данные в Java, а также управлять ключами, пордписями
 * и осуществлять аутентификацию(проверку подлинности) сообщений, вычислять криптографические хэши и многое другое. Архитектура
 * криптографии Java структурирована вокруг нескольких основных классов и интерфейсов общего назначения. Реальная же фукнциональность
 * обеспечивается поставщиками реализаций. То есть, можно использовать класс Cipher(шифр) для шифрования и расшифровки данных, но
 * конкретная реализация шифра(алгоритм шифрования) зависит от библиотеки, реализующей Java Cryptography API. К таким библиотекам,
 * например, относится Bouncy Castle. Подробнее о классах и пакетах (https://habr.com/ru/post/444764/).
 * Java Keytool - это инструмент командной строки, который может генерировать пары открытый ключ/закрытый ключ и сохранять их в
 * хранилище ключей(keyStore). Исполняемый файл утилиты поставляется вместе с JDK(или JRE) и называется keytool
 *
 * */

package habr.java_crypt;

public class Main {
}
