/**
 *
 *                                            https://habr.com/company/dataart/blog/262817/
 * Терминология:
 *   - Идентификация - это заявление о том, кем мы являемся. Это может быть имя, адрес электронной почты, номер учетки
 *          и т д.
 *   - Аутентификация - предоставление доказательств того, что мы на самом деле есть тот, кем Идентифицировались (от слова
 *          authentic - истинный, подлинный).
 *   - Авторизация - проверка того, что нам разрешен доступ к запрашиваемому ресурсу.
 * Например, при попытке попасть в закрытый клуб, нас Идентифицируют(просят назвать имя и фамилию), Аутентифицируют
 * (например, просят показать паспорт и сверят фио и фотографию) и Авторизуют(проверят, что фамилия есть в списке гостей).
 * И все это прежде, чем пустят нас внутрь. Аналогично эти термины применяются в компьютерных системах, где традиционно
 * под Идентификацией понимают получение нашей учетной записи по username или email(возможны другие варианты), под
 * Аутентификацией - проверку, что мы знаем пароль от этой учетной записи, а под Авторизацией - проверку нашей роли в
 * системе и решение о предоставлении доступа к запрошенной странице или ресурсу.
 * Аутентификация по паролю.
 * Пользователь должен предоставить username и password для успешной идентификации и аутентификации в системе. Применительно
 * к веб-приложениям, существует несколько стандартных протоколов для аутентификации по паролю. Основной - аутентификация
 * по HTTP.
 *
 * */

package habr.authentication;

public class Article1 {
}
