/**
 *
 *                                                Обзор класса URLConnection.
 * Класс URLConnection является классом общего назначения т предназначен для доступа к атрибутам удаленного ресурса. Как
 * только будет установлено соединение с удаленным сервером, класс URLConnection можно использовать для просмотра свойств
 * удаленного объекта, прежде чем переносить его локально. Эти атрибуты раскрываются в спецификации протокола HTTP и как
 * таковые имеют смысл только для объектов типа URL.
 * Его методы:
 *
 *
 * */


package article;

public class CustomUrlConnection {
}
